## Staging: hosted_zone
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |               NAME                |
|--------|-----------------------------------|
| add    | `aws_route53_zone.form_viewer[1]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_zone.form_viewer[1] will be created
  + resource "aws_route53_zone" "form_viewer" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "api.forms-staging.cdssandbox.xyz"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + zone_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ hosted_zone_ids   = [
        "Z05990652HOQ0SGHD81ZC",
      + (known after apply),
    ]
  ~ hosted_zone_names = [
        "forms-staging.cdssandbox.xyz",
      + "api.forms-staging.cdssandbox.xyz",
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.form_viewer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.form_viewer[1]"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
